DocumentJournals/ДокументыПоОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоОС</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПринятиеКУчетуОС</xr:Item>
				<xr:Item>Document.МодернизацияОС</xr:Item>
				<xr:Item>Document.ПеремещениеОС</xr:Item>
				<xr:Item>Document.ПодготовкаКПередачеОС</xr:Item>
				<xr:Item>Document.СписаниеОС</xr:Item>
				<xr:Item>Document.ИнвентаризацияОС</xr:Item>
				<xr:Item>Document.ИзменениеПараметровОС</xr:Item>
				<xr:Item>Document.ИзменениеСостоянияОС</xr:Item>
				<xr:Item>Document.ПоступлениеУслугПрочихАктивов</xr:Item>
				<xr:Item>Document.ВнутреннееПотреблениеТоваров</xr:Item>
				<xr:Item>Document.РегистрацияНаработок</xr:Item>
				<xr:Item>Document.РеализацияУслугПрочихАктивов</xr:Item>
				<xr:Item>Document.ПередачаОСАрендатору</xr:Item>
				<xr:Item>Document.ВозвратОСОтАрендатора</xr:Item>
				<xr:Item>Document.ПоступлениеАрендованныхОС</xr:Item>
				<xr:Item>Document.ВыбытиеАрендованныхОС</xr:Item>
				<xr:Item>Document.ПоступлениеПредметовЛизинга</xr:Item>
				<xr:Item>Document.ПереоценкаОС</xr:Item>
				<xr:Item>Document.РегистрацияЗемельныхУчастков</xr:Item>
				<xr:Item>Document.ОтменаРегистрацииЗемельныхУчастков</xr:Item>
				<xr:Item>Document.РегистрацияТранспортныхСредств</xr:Item>
				<xr:Item>Document.ОтменаРегистрацииТранспортныхСредств</xr:Item>
				<xr:Item>Document.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество</xr:Item>
				<xr:Item>Document.ИзменениеСпособаОтраженияИмущественныхНалогов</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИзменениеПараметровОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИзменениеСостоянияОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Организация</xr:Item>
						<xr:Item>Document.РеализацияУслугПрочихАктивов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеУслугПрочихАктивов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПередачаОСАрендатору.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеАрендованныхОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВыбытиеАрендованныхОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеПредметовЛизинга.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПереоценкаОС.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииТранспортныхСредств.Attribute.Организация</xr:Item>
						<xr:Item>Document.РегистрацияТранспортныхСредств.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииЗемельныхУчастков.Attribute.Организация</xr:Item>
						<xr:Item>Document.РегистрацияЗемельныхУчастков.Attribute.Организация</xr:Item>
						<xr:Item>Document.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Attribute.Организация</xr:Item>
						<xr:Item>Document.ИзменениеСпособаОтраженияИмущественныхНалогов.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СобытиеОС</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.СобытиеПодготовкиОС</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ИзменениеПараметровОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ИзменениеСостоянияОС.Attribute.СобытиеОС</xr:Item>
						<xr:Item>Document.ПереоценкаОС.Attribute.СобытиеОС</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИзменениеПараметровОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИзменениеСостоянияОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеУслугПрочихАктивов.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РеализацияУслугПрочихАктивов.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РегистрацияНаработок.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПередачаОСАрендатору.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеАрендованныхОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ВыбытиеАрендованныхОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеПредметовЛизинга.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПереоценкаОС.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииТранспортныхСредств.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РегистрацияТранспортныхСредств.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииЗемельныхУчастков.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РегистрацияЗемельныхУчастков.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ИзменениеСпособаОтраженияИмущественныхНалогов.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.СписаниеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПодготовкаКПередачеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПринятиеКУчетуОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПеремещениеОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.МодернизацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИнвентаризацияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИзменениеПараметровОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИзменениеСостоянияОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВнутреннееПотреблениеТоваров.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеУслугПрочихАктивов.Attribute.Менеджер</xr:Item>
						<xr:Item>Document.РеализацияУслугПрочихАктивов.Attribute.Менеджер</xr:Item>
						<xr:Item>Document.РегистрацияНаработок.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВыбытиеАрендованныхОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеАрендованныхОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ВозвратОСОтАрендатора.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПередачаОСАрендатору.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеПредметовЛизинга.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПереоценкаОС.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииТранспортныхСредств.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РегистрацияТранспортныхСредств.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ОтменаРегистрацииЗемельныхУчастков.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РегистрацияЗемельныхУчастков.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ИзменениеСпособаОтраженияИмущественныхНалогов.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.УчетПоНаправлениямДеятельности</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПредставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроводокДляМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроводки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроводокМеждународныйУчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/РегистрацияНаработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>РегистрацияНаработок</Name>
			<BasedOn>
				<xr:Item>Catalog.ОбъектыЭксплуатации</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НаработкиОбъектовЭксплуатации</xr:Item>
				<xr:Item>InformationRegister.ПериодыАктуальностиОбъектовЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднесуточноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетныеНаработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектЭксплуатации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательНаработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднесуточноеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DocumentJournals/ДокументыПоОС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если СтруктураБыстрогоОтбора <> Неопределено Тогда
		СтруктураБыстрогоОтбора.Свойство("Организация", Организация);
		СтруктураБыстрогоОтбора.Свойство("ОбъектЭксплуатации", ОбъектЭксплуатации);
		СтруктураБыстрогоОтбора.Свойство("Тип", Тип);
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектЭксплуатации") И ЗначениеЗаполнено(Параметры.ОбъектЭксплуатации) Тогда
		Элементы.ОтборОбъектЭксплуатации.Видимость = Ложь;
		ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(
		Список,
		"Организация",
		Организация,
		СтруктураБыстрогоОтбора);
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриСозданииНаСервере(
		Список,
		"Тип",
		Тип,
		СтруктураБыстрогоОтбора,
		Тип.Количество()>0,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ЗаданОбъектЭксплуатации", ЗначениеЗаполнено(ОбъектЭксплуатации));
	
	//++ НЕ УТКА
	Если НЕ ПравоДоступа("Просмотр", Метаданные.РегистрыБухгалтерии.Международный) Тогда
		Элементы.ДвиженияМФУ.Видимость = Ложь;
	КонецЕсли;
	//-- НЕ УТКА
	
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеОтчетыИОбработкиКлиентСервер.ТипФормыСписка());
	
	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(ОбъектЭксплуатации) Тогда
		Настройки.Удалить("ОбъектЭксплуатации");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(
		Список,
		"Организация",
		Организация,
		СтруктураБыстрогоОтбора,
		Настройки);
	
	Если Настройки["Тип"] <> Неопределено Тогда
		ИспользованиеЭлементаОтбора = Настройки["Тип"].Количество() > 0;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ОтборПоЗначениюСпискаПриЗагрузкеИзНастроек(
		Список,
		"Тип",
		Тип,
		СтруктураБыстрогоОтбора,
		Настройки,
		ИспользованиеЭлементаОтбора,
		ВидСравненияКомпоновкиДанных.ВСписке);
	
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ЗаданОбъектЭксплуатации", ЗначениеЗаполнено(ОбъектЭксплуатации));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаОтметкиЭлементов" Тогда
		ВыполнитьПослеЗакрытияСпискаВыбора(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		Организация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", Организация, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборОбъектЭксплуатацииПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОбъектЭксплуатации", ОбъектЭксплуатации);
	Список.Параметры.УстановитьЗначениеПараметра("ЗаданОбъектЭксплуатации", ЗначениеЗаполнено(ОбъектЭксплуатации));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = ПолучитьЗначенияСписка();
	
	Для каждого Элемент Из Тип Цикл
		ЭлементСписка = СписокВыбора.НайтиПоЗначению(Элемент.Значение);
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементСписка.Пометка = Элемент.Пометка;
		КонецЕсли;
	КонецЦикла;
	
	СписокВыбора.СортироватьПоПредставлению();
	
	ОткрытьФорму("ОбщаяФорма.ФормаОтметкиЭлементов",Новый Структура("СписокЗначений", СписокВыбора),ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТипДокументаОчистка(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Тип",
		Тип,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДвиженияМФУ(Команда)
	
	//++ НЕ УТКА
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	ПараметрыОтбора = Новый Структура("Регистратор", ТекущаяСтрока);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ОткрытьФорму("РегистрБухгалтерии.Международный.Форма.ПроводкиМеждународногоУчета", ПараметрыФормы, ЭтаФорма, ЭтаФорма);
	
	//-- НЕ УТКА
	
	Возврат; // Пустой обработчик для УТ и КА
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнутреннееПотребление(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию"));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВнутреннееПотреблениеТоваров.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеУслугПрочихАктивов(Команда)
	
	ОткрытьФорму("Документ.ПоступлениеУслугПрочихАктивов.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПринятиеКУчету(Команда)
	
	ОткрытьФорму("Документ.ПринятиеКУчетуОС.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещение(Команда)
	ОткрытьФорму("Документ.ПеремещениеОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменениеПараметров(Команда)
	ОткрытьФорму("Документ.ИзменениеПараметровОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменениеСостояния(Команда)
	ОткрытьФорму("Документ.ИзменениеСостоянияОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрациюНаработок(Команда)
	ОткрытьФорму("Документ.РегистрацияНаработок.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнвентаризацию(Команда)
	ОткрытьФорму("Документ.ИнвентаризацияОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМодернизацию(Команда)
	ОткрытьФорму("Документ.МодернизацияОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СодатьПередачуАрендатору(Команда)
	ОткрытьФорму("Документ.ПередачаОСАрендатору.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВозвратОтАрендатора(Команда)
	ОткрытьФорму("Документ.ВозвратОСОтАрендатора.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПодготовкуКПередаче(Команда)
	ОткрытьФорму("Документ.ПодготовкаКПередачеОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписание(Команда)
	ОткрытьФорму("Документ.СписаниеОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализациюУслугПрочихАктивов(Команда)
	ОткрытьФорму("Документ.РеализацияУслугПрочихАктивов.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеАрендованныхОС(Команда)
	ОткрытьФорму("Документ.ПоступлениеАрендованныхОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыбытиеАрендованныхОС(Команда)
	ОткрытьФорму("Документ.ВыбытиеАрендованныхОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеПредметовЛизинга(Команда)
	ОткрытьФорму("Документ.ПоступлениеПредметовЛизинга.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПереоценку(Команда)
	ОткрытьФорму("Документ.ПереоценкаОС.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрациюПорядкаНалогообложенияПоНалогуНаИмущество(Команда)
	ОткрытьФорму("Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрациюЗемельныхУчастков(Команда)
	ОткрытьФорму("Документ.РегистрацияЗемельныхУчастков.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтменуРегистрацииЗемельныхУчастков(Команда)
	ОткрытьФорму("Документ.ОтменаРегистрацииЗемельныхУчастков.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрациюТранспортныхСредств(Команда)
	ОткрытьФорму("Документ.РегистрацияТранспортныхСредств.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтменуРегистрацииТранспортныхСредств(Команда)
	ОткрытьФорму("Документ.ОтменаРегистрацииТранспортныхСредств.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменениеСпособаОтраженияИмущественныхНалогов(Команда)
	ОткрытьФорму("Документ.ИзменениеСпособаОтраженияИмущественныхНалогов.ФормаОбъекта");
КонецПроцедуры

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец МенюОтчеты

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияСпискаВыбора(СписокВыбора) 

	Если СписокВыбора <> Неопределено Тогда
		
		Для каждого ЭлементСписка Из СписокВыбора Цикл
			
			НайденноеЗначение = Тип.НайтиПоЗначению(ЭлементСписка.Значение);
			
			Если ЭлементСписка.Пометка и НайденноеЗначение = Неопределено Тогда
				НайденноеЗначение = Тип.Добавить();
				ЗаполнитьЗначенияСвойств(НайденноеЗначение,ЭлементСписка);
			КонецЕсли;
			
			Если Не ЭлементСписка.Пометка и НайденноеЗначение <> Неопределено Тогда
				Тип.Удалить(НайденноеЗначение);
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Тип",
		Тип,
		ВидСравненияКомпоновкиДанных.ВСписке,,
		Тип.Количество() > 0);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияСписка()
	
	СписокВыбора = Новый СписокЗначений();
	
	Для Каждого ОписаниеМетаданныхДокумента Из Метаданные.ЖурналыДокументов.ДокументыПоОС.РегистрируемыеДокументы Цикл
		СписокВыбора.Добавить(Тип("ДокументСсылка." + ОписаниеМетаданныхДокумента.Имя), ОписаниеМетаданныхДокумента.Синоним);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти
